app/controllers/movies_controller.rb

    def index
      # session persists only as long as page is open?
      # session.clear
      session[:sortCol] = params[:sortCol] || session[:sortCol] || nil                  # params else session else nothing,
      if !['title', 'release_date', nil].include?(session[:sortCol])                    # make sure input matches allowed values.
        session[:sortCol] = nil
      end
      # puts Movie.find(:all, :order => "LOWER(#{session[:sortCol]})")
      @movies = session[:sortCol].blank? ? Movie.all : Movie.all.order("LOWER(CAST(#{session[:sortCol]} AS text))") # if no sortCol then all movies else order movies.
      @all_ratings = Movie.get_ratings
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R') AND "movies"."rating" IN ('G', 'R')  ORDER BY release_date